Revit 2026 API

# ISingleServerService Methods

---

The ISingleServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to execute the given server. (Inherited from IExternalService) |
|  | GetDescription | Implement this method to return a description of the service. (Inherited from IExternalService) |
|  | GetName | Implement this method to return the name of the service. (Inherited from IExternalService) |
|  | GetServiceId | Implement this method to return the unique Id of the service. (Inherited from IExternalService) |
|  | GetVendorId | Implement this method to return the vendor Id of the service. (Inherited from IExternalService) |
|  | IsValidServer | Implement this method to check if the given instance represents a valid server of this service. (Inherited from IExternalService) |
|  | OnServersChanged | (Inherited from IExternalService) |
|  | OnServersDisparity | (Inherited from IExternalService) |

#### Reference

ISingleServerService Interface

Autodesk.Revit.DB.ExternalService Namespace